png("plot-ex07.png", width=600)
a <- c(90015.5,  6816.5,  2166.6,  1245.4)
b <- c(65957.7,	24874.5,	8037.2,	13886.5)
c <- c(87962.9,	31271.2,	12815.2,	7181.1)
ABC <- cbind(a,b,c)
rownames(ABC) <- c("налог на прибыль организаций","налог на доходы физических лиц","налогина имущество","безвозмездныепоступления")
colnames(ABC) <- c("2005","2013","2017")
barplot(ABC,col = topo.colors(4,alpha = 1), )
legend("bottomleft",
       legend=c("налог на прибыль организаций","налог на доходы физических лиц","налогина имущество","безвозмездные поступления"), 
       fill=topo.colors(4))
